# Pandas

In [1]:
import pandas as pd

# Pandas Data structures
series
DataFrame
#### Series ####

In [2]:
s1 = pd.Series([11,22,33,44,55,66,77,88,99,10])

In [4]:
s1   #Pandas Series Object 
#index [(0-9) default index given by series object]

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

In [5]:
s1[9] #ACCESSING value by index

10

In [7]:
s1[[2,4,7,9,0]]  #ACCESSING multiple values

2    33
4    55
7    88
9    10
0    11
dtype: int64

In [17]:
s1[5] = 555   #modifying a value in series
s1[[2,3,4]]=[222,333,444]

In [28]:
s1

0     11
1     22
2    222
3    333
6     77
7     88
8     99
9     10
dtype: int64

In [37]:
del s1[2]  #deleting a value in series

In [38]:
s1

0      11
1      22
3     333
6      77
7      88
8      99
9      10
99    999
dtype: int64

In [41]:
s1[99] = 999   #insert in a series with a new index

In [42]:
s1

0      11
1      22
3     333
6      77
7      88
8      99
9      10
99    999
dtype: int64

# Define our Index

In [45]:
s2 = pd.Series([10,20,30,40], index=["orange","apple","banana","kiwi"])

In [46]:
s2

orange    10
apple     20
banana    30
kiwi      40
dtype: int64

In [47]:
s2.index

Index(['orange', 'apple', 'banana', 'kiwi'], dtype='object')

In [52]:
ourindex=["orange","apple","banana","kiwi"]
s2 = pd.Series([10,20,30,40], index=ourindex)

In [53]:
s2

orange    10
apple     20
banana    30
kiwi      40
dtype: int64

In [56]:
s2>30 # or
s2[s2>30]

kiwi    40
dtype: int64

In [60]:
s2<30  #or
s2[s2<30]

orange    10
apple     20
dtype: int64

In [61]:
'peech' in s2  #checking if required key is in series or not

False

In [62]:
'orange' in s2  #checking if required key is in series or not

True

# Creating Series by using a dictionary

In [88]:
sdata = {'ohio':3500, 'texas':7100, 'orego': 1600, 'utah': 5000}
data = pd.Series(sdata)

In [89]:
data

ohio     3500
texas    7100
orego    1600
utah     5000
dtype: int64

In [90]:
states = ['california','ohio', 'texas', 'orego']
d1 = pd.Series(sdata, index=states)

In [91]:
d1

california       NaN
ohio          3500.0
texas         7100.0
orego         1600.0
dtype: float64

In [92]:
d1.isnull()

california     True
ohio          False
texas         False
orego         False
dtype: bool

In [93]:
d1.notnull()

california    False
ohio           True
texas          True
orego          True
dtype: bool

In [94]:
d1['california']= 4755

In [95]:
d1

california    4755.0
ohio          3500.0
texas         7100.0
orego         1600.0
dtype: float64

# Data Frames

In [102]:
data = {'state': ['ohio', 'ohio', 'ohio', 'neveda', 'neveda', 'neveda'],
        'year':  [2000, 2001, 2002, 2001, 2002, 2003],
        'pop':   [1.5, 1.7, 3.6, 2.4, 2.9,3.2]}
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  neveda  2001  2.4
4  neveda  2002  2.9
5  neveda  2003  3.2

In [103]:
data = {'makeup': ['base', 'lipstick', 'mascara'],
        'exdate': [2001, 2004, 2006,],
        'price':  [400, 200, 100]}
d1 = pd.DataFrame(data)
d1

     makeup  exdate  price
0      base    2001    400
1  lipstick    2004    200
2   mascara    2006    100

# Student data

In [105]:
data = {'student': ['alina', 'maham', 'haya', 'jihan'],
        'rollnum': [12, 13, 14, 15],
        'totalno': [850, 800, 750, 700]}
d1 = pd.DataFrame(data)
d1

  student  rollnum  totalno
0   alina       12      850
1   maham       13      800
2    haya       14      750
3   jihan       15      700

In [106]:
type(d1)

pandas.core.frame.DataFrame

In [107]:
d1.shape

(4, 3)

In [116]:
df1['pop']   # d1['pop'] or selecting single columns by column headers

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [114]:
df1[['pop', 'state']]   #selecting multiple columns by colunm headers

   pop   state
0  1.5    ohio
1  1.7    ohio
2  3.6    ohio
3  2.4  neveda
4  2.9  neveda
5  3.2  neveda

In [117]:
del df1['pop']  #deleting a coulumn

In [118]:
df1

    state  year
0    ohio  2000
1    ohio  2001
2    ohio  2002
3  neveda  2001
4  neveda  2002
5  neveda  2003

In [123]:
df1['debt']= 100
df1

    state  year  debt
0    ohio  2000   100
1    ohio  2001   100
2    ohio  2002   100
3  neveda  2001   100
4  neveda  2002   100
5  neveda  2003   100

In [122]:
df1['debt']=[100, 200 , 300 , 400, 500, 600]
df1

    state  year  debt
0    ohio  2000   100
1    ohio  2001   200
2    ohio  2002   300
3  neveda  2001   400
4  neveda  2002   500
5  neveda  2003   600

In [124]:
df1['debt']=range(6)

In [125]:
df1

    state  year  debt
0    ohio  2000     0
1    ohio  2001     1
2    ohio  2002     2
3  neveda  2001     3
4  neveda  2002     4
5  neveda  2003     5

In [127]:
df1['debt']=df1['state']

In [128]:
df1

    state  year    debt
0    ohio  2000    ohio
1    ohio  2001    ohio
2    ohio  2002    ohio
3  neveda  2001  neveda
4  neveda  2002  neveda
5  neveda  2003  neveda

In [199]:
dic = {'AI for EO': [78,88,99,90,67],
      'Python1': [90,30,20,34,78],
      'Python2': [34,56,43,22,11]}
df = pd.DataFrame(dic, index=['nasir', 'asad', 'ramsha',
                               'mansoor', 'saba'])
df

         AI for EO  Python1  Python2
nasir           78       90       34
asad            88       30       56
ramsha          99       20       43
mansoor         90       34       22
saba            67       78       11

In [200]:
df['total']=df['AI for EO']+df['Python1']+df['Python2']

In [201]:
df

         AI for EO  Python1  Python2  total
nasir           78       90       34    202
asad            88       30       56    174
ramsha          99       20       43    162
mansoor         90       34       22    146
saba            67       78       11    156

In [202]:
df['status']=['Pass' if marks>= 200 else 'Fail' for marks in df.total ]
df

         AI for EO  Python1  Python2  total status
nasir           78       90       34    202   Pass
asad            88       30       56    174   Fail
ramsha          99       20       43    162   Fail
mansoor         90       34       22    146   Fail
saba            67       78       11    156   Fail

In [221]:
df['percentg']=(df.total/400)*100
df

         AI for EO  Python1  Python2  total status  percentg
nasir           78       90       34    202   Pass      50.5
asad            88       30       56    174   Fail      43.5
ramsha          99       20       43    162   Fail      40.5
mansoor         90       34       22    146   Fail      36.5
saba            67       78       11    156   Fail      39.0

In [232]:
df['status']=['Pass' if Ai>= 33 and p1>= 33 and p2>= 20 else 'Fail' 
              for Ai , p1, p2 in zip (df['AI for EO'], df['Python1'], df['Python2'])]
df

         AI for EO  Python1  Python2  total status  percentg
nasir           78       90       34    202   Pass      50.5
asad            88       30       56    174   Fail      43.5
ramsha          99       20       43    162   Fail      40.5
mansoor         90       34       22    146   Pass      36.5
saba            67       78       11    156   Fail      39.0

In [227]:
numbers = [1,2,3,4,5,6,7,8,9,0]
evenArr = []
oddArr = []
for num in numbers:
    if num%2 == 0:
        evenArr.append(num)
    else:
        oddArr.append(num)
print('even>>', evenArr)
print('odd',oddArr)

even>> [2, 4, 6, 8, 0]
odd [1, 3, 5, 7, 9]

In [228]:
[num for num in numbers if num%2==0 ]

[2, 4, 6, 8, 0]

In [230]:
a = list(range(5))
b = list(range(6,11))
a

[0, 1, 2, 3, 4]

In [233]:
df.head()

         AI for EO  Python1  Python2  total status  percentg
nasir           78       90       34    202   Pass      50.5
asad            88       30       56    174   Fail      43.5
ramsha          99       20       43    162   Fail      40.5
mansoor         90       34       22    146   Pass      36.5
saba            67       78       11    156   Fail      39.0